create table if not exists agreement (
    agreement_id uuid primary key default gen_random_uuid(),
    create_date date,
    name varchar
);

create table if not exists document (
	document_id uuid primary key default gen_random_uuid(),
	sign_date date,
	create_date date,
	number integer,
	name varchar,
	agreement_id uuid references agreement (agreement_id) on delete cascade on update cascade
);

INSERT INTO agreement (agreement_id, create_date, name)
VALUES
    ('550e8400-e29b-41d4-a716-446655440000', '2023-10-01', 'Кредитный договор №12345'),
    ('550e8400-e29b-41d4-a716-446655440001', '2023-10-02', 'Договор аренды помещения №67890'),
    ('550e8400-e29b-41d4-a716-446655440002', '2023-10-03', 'Договор оказания услуг №54321'),
    ('550e8400-e29b-41d4-a716-446655440003', '2023-10-04', 'Договор купли-продажи автомобиля №98765'),
    ('550e8400-e29b-41d4-a716-446655440004', '2023-10-05', 'Договор подряда на строительство №11223');

INSERT INTO document (document_id, sign_date, create_date, number, name, agreement_id)
VALUES
    -- Документы для договора 1 (Кредитный договор №12345)
    ('660e8400-e29b-41d4-a716-446655440000', '2023-10-01', '2023-10-01', 1, 'Дополнительное соглашение №1', '550e8400-e29b-41d4-a716-446655440000'),
    ('660e8400-e29b-41d4-a716-446655440001', '2023-10-02', '2023-10-01', 2, 'Акт приема-передачи №1', '550e8400-e29b-41d4-a716-446655440000'),

    -- Документы для договора 2 (Договор аренды помещения №67890)
    ('660e8400-e29b-41d4-a716-446655440002', '2023-10-03', '2023-10-02', 1, 'Дополнительное соглашение №2', '550e8400-e29b-41d4-a716-446655440001'),
    ('660e8400-e29b-41d4-a716-446655440003', '2023-10-04', '2023-10-02', 2, 'Акт приема-передачи №2', '550e8400-e29b-41d4-a716-446655440001'),

    -- Документы для договора 3 (Договор оказания услуг №54321)
    ('660e8400-e29b-41d4-a716-446655440004', '2023-10-05', '2023-10-03', 1, 'Дополнительное соглашение №3', '550e8400-e29b-41d4-a716-446655440002'),
    ('660e8400-e29b-41d4-a716-446655440005', '2023-10-06', '2023-10-03', 2, 'Акт приема-передачи №3', '550e8400-e29b-41d4-a716-446655440002'),

    -- Документы для договора 4 (Договор купли-продажи автомобиля №98765)
    ('660e8400-e29b-41d4-a716-446655440006', '2023-10-07', '2023-10-04', 1, 'Дополнительное соглашение №4', '550e8400-e29b-41d4-a716-446655440003'),
    ('660e8400-e29b-41d4-a716-446655440007', '2023-10-08', '2023-10-04', 2, 'Акт приема-передачи №4', '550e8400-e29b-41d4-a716-446655440003'),

    -- Документы для договора 5 (Договор подряда на строительство №11223)
    ('660e8400-e29b-41d4-a716-446655440008', '2023-10-09', '2023-10-05', 1, 'Дополнительное соглашение №5', '550e8400-e29b-41d4-a716-446655440004'),
    ('660e8400-e29b-41d4-a716-446655440009', '2023-10-10', '2023-10-05', 2, 'Акт приема-передачи №5', '550e8400-e29b-41d4-a716-446655440004');